niuyang={
'芥兰牛' : ['芥兰','牛肉','老抽','生抽','耗油','姜','蒜','盐','油','淀粉','胡椒粉'],
};

zhurou={
'红烧肉' : ['五花肉','姜','八角','葱','桂皮','冰糖','生抽','料酒','盐','老抽'],
'尖椒香干炒肉丝' : ['尖椒','肉丝','香干','黄酒','糖','酱油'],
'焦溜肉片' : ['里脊肉','青椒','淀粉','葱','姜','蒜','蚝油','酱油','老抽','盐','白糖','鸡精','料酒'],
'焦溜丸子' : ['猪肉','料酒','鸡蛋','葱','姜','甜面酱','淀粉','花椒粉','香油'],
'辣椒炒香肠' : ['香肠','薄皮辣椒','洋葱','姜','盐','生抽'],
'青笋肉片' : ['莴笋','猪肉','蒜','干辣椒','料酒','淀粉','生抽','黑胡椒粉','蚝油','盐'],
'糖醋里脊' : ['里脊肉','料酒','盐','鸡蛋','番茄酱','糖','白醋','淀粉','面粉'],
'糖醋排骨' : ['猪排','料酒','盐','生抽','冰糖','白醋','老抽','八角','香叶','葱','姜'],
};

jiya={
'红烧鸡' : ['鸡腿','干辣椒','八角','花椒','姜','大葱','蒜','生抽','老抽','豆瓣酱','蚝油','冰糖'],
'可乐鸡翅' : ['鸡翅','可乐','姜','盐','啤酒','生抽','老抽','熟白芝麻'],
};

haixian={
'红烧带鱼' : ['带鱼','生抽','老抽','蚝油','香醋','料酒','白糖','花椒','八角','干辣椒','葱','姜','蒜','面粉'],
'水煮鱼' : ['鱼片','姜','蒜','淀粉','花椒','料酒','盐','干辣椒','豆瓣酱','黄豆芽'],
'酸菜鱼' : ['草鱼','香菜','葱','姜','蒜','生粉','白胡椒粉','花椒','料酒','盐','干辣椒','豆瓣酱','酸菜'],
'油焖大虾' : ['虾','姜','蒜','葱','白糖','生抽','料酒','盐'],
};

shucai={
'麻婆豆腐' : ['豆腐','淀粉','葱','蒜','朝天椒','花椒粉','豆瓣酱','肉末','姜','盐','生抽','白胡椒粉','辣椒面','花椒','鸡精'],
'香菇油菜' : ['香菇','油菜','生抽','蚝油','盐','蒜'],
'鱼香茄子' : ['茄子','肉末','葱','姜','蒜','小米辣','豆瓣酱','老抽','生抽','醋','蚝油','糖','淀粉'],
};

mianshi={
'包子' : ['面粉','酵母','白糖','猪肉','葱','料酒','生抽','老抽','蚝油','芝麻油','盐','胡椒粉','油'],
'葱油饼' : ['面粉','盐','葱'],
'刀削面' : ['刀削面','西红柿','里脊肉','大料','香叶','小油菜'],
'韭菜盒子' : ['面粉','韭菜','鸡蛋','盐','油'],
'凉粉' : ['豌豆淀粉'],
'三鲜水饺' : ['猪肉','虾仁','木耳','鸡蛋','香菇','韭菜','料酒','生抽','蚝油','盐','葱','姜','香油','油'],
'西红柿鸡蛋面片' : ['面','鸡蛋','小青菜','西红柿','葱','蒜','姜'],
};



